{
  "body": "#### SFRR-Europe\n\n**SFRR-Europe Visiting Fellowships 2024** \n\nApplications for SFRR-Europe Visiting Fellowships for 2024 are open until 15 May 2024. Awards of up to €2000 will be made to Early Career Investigators to cover travel and accommodation expenses for a short research stay \\[minimum 3 weeks] in another European laboratory, to be completed before June 2025. The number of awards made will be determined by the quality of the submitted proposals.\n\nApplicants should submit a single PDF containing:\n\n* a brief summary of the research project (maximum one A4 page) stating the expected duration, budget, rationale and expected outcomes from the short stay.\n* CV (maximum 2 A4 pages) of the applicant including date of birth, date of PhD award (if applicable), current position and a list of publications.\n* abbreviated CVs of both the home and proposed host supervisors (maximum 2 A4 pages each). **Both  home and host supervisors must be members of SFRR-Europe**\n* a letter from the host institution agreeing to host and provide facilities for the visitor.\n\nPrevious awardees of Early Career Researcher (ECR) Fellowships or Visiting Fellowships are not eligible.\n\nApplications should be submitted by logging-in to the SFRR-E intranet ([https://intranet.sfrr-europe.org](https://eur03.safelinks.protection.outlook.com/?url=https%3A%2F%2Fintranet.sfrr-europe.org%2F&data=05%7C02%7Cgiovanni.mann%40kcl.ac.uk%7Cff03516ce24a444f293508dc636699cc%7C8370cf1416f34c16b83c724071654356%7C0%7C0%7C638494539515338123%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&sdata=%2Fk4yPiSphouWvpcMMlIipaIUBk4zwtH4lS7O5XFoYLs%3D&reserved=0)) and selecting the call for SFRR-E VISITING FELLOWSHIPS 2024. Applications which do not adhere to the above requirements, will not be considered.\n\nThe deadline for applications is **15 May 2024**, and the results will be announced at the General Assembly of SFRR-E, held during the SFRR-Europe Annual Meeting in Istanbul, 4-7 June 2024.\n\nRequirements for the applicant:\n\n* Under 35 years of age and without a permanent university position\n* **Member of SFRR-Europe**\n* Presentation of a brief written report, and details of expenditure, to the SFRR-Europe Executive one month after the research visit. The report may be posted on the SFRR-Europe website.\n* Requirements for the supervisors at the home and host institutions:\n\n**Clare Hawkins, General Secretary of SFRR-Europe**\n\n##### **FEBS Advanced Course in partnership with SFRR-Europe and IUBMB (sponsored by OCC, ProMoAge and COST) in Spetses , Greece 30 September - 6 October 2024  (deadline extended to 1 May 2024)**\n\nThis Summer School is one in a series of biennial SFRR Free Radical Schools. This year, it is being organized as a FEBS Advanced Course in partnership with SFRR-Europe and IUBMB and is sponsored by OCC, ProMoAge and COST (<https://redoxbiochemistry2024.febsevents.org>)\n\nThe course “Redox biochemistry: cellular responses and disease relevance” will focus on recent developments in this exciting field of redox biology. Well-established scientists from Europe and the Americas who are at the forefront of their field will present key aspects of this topic: redox control, signalling and cellular adaptations, downstream outcomes. Being especially critical, we will highlight the true evidence on the role of redox-related processes in disease, since too often the simple (clinical) statement “here are oxidants involved, treat with antioxidants” leads to a misjudgment of the situation.\n\nSpecifically, the course will focus on examining how changes in redox signalling trigger endogenous adaptation and the crucial role of key adaptive processes in preventing cellular degeneration.\n\nAll participants will have the opportunity to interact frequently in a relaxed setting with prominent senior scientists in the field, and to present and discuss their results in poster sessions and oral presentations.\n\nWe are looking forward to personally welcoming you in Spetses, to participate in this exciting course!\n\n**Tilman Grune and Niki Chondrogianni, Course Organizers**"
}
