{
  "body": "## Rules for Conference Organisation\n\n#### GUIDELINES FOR THE ORGANISERS OF INTERNATIONAL CONGRESSES\n\n#### Special Features of SFRRI Congresses\n\nCongresses provide unique occasions for expert review of international advances in free radical biology and related fields being comprehensive in their coverage of free radical biology and related subjects and have an expected attendance of 400-800 persons. They provide concentrated opportunities to academic teachers and scientists in specialized research or in routine work to broaden and upgrade their knowledge.  They provide occasions for those actively involved in specialized research to present and discuss their work with an audience of diverse interests.\n\nA potential host organization must provide a written statement at the time of application giving assurances that the ICSU policy on free circulation of scientists, including a timetable for visa application and issuance, as recommended in the 1989 Resolution on the Free Circulation of Scientists, will apply.  This provides for written assurances that: \n\n* no obstacles will be put to the granting of visas to bona fide scientists who wish to participate\n* information will be supplied concerning the mechanism for applications for visas and the time normally required between application for and receipt of a visa\n\nIf the application is successful, the host organization will provide in writing an assurance to undertake to continue to observe the ICSU recommendations up to and during the Congress.\n\nA host organisation agrees, in writing, to observe the Guidelines for SFRRI Congresses. \n\nCongress organisers will keep the Executive Committee of SFRRI well informed of the status of their planning through the Secretary General and consult with him/her on any matter of direct concern to SFRRI.  Planning of a Congress at all stages shall be made by the Organizing Committee and representatives of the SFRRI.  The organizers will supply the Secretary General with copies of all minutes of planning meetings and of all announcements and other publications.  The Secretary General is to be invited in the year that precedes the Congress by two years and at the expense of the Organizing Committee, to attend a meeting of that Organizing Committee.  During the same period, a member of the Organizing Committee will be invited, to attend an annual meeting of the Executive Committee of SFRRI to discuss plans for the Congress. \n\nThe Organizing Committee presents a tentative outline of the program for the Congress, including topics for symposia and colloquia and possibly plenary lectures, to the Executive Committee of SFRRI at least two years in advance of the Congress. \n\nA host society for a Congress selects the Organizing Committee and forms an Advisory Committee including representatives of the Executive Committee of SFRRI, composed of internationally distinguished free radical scientists from outside its country to serve as Advisors who will help identify topics for each symposium \n\nThe Organizing Committee ensures that the scheduling of the Congress does not conflict with any major scientific meeting. \n\nSoon after conclusion of the Congress the organizers will supply the Secretary General with a full report of the Congress and recommendations for the benefit of future Congress organizers. \n\nThe Secretary General will offer all assistance and advice to the organizers.\n\n#### Lecturers\n\nChoice of lecturers, particularly plenary lectures, is governed by their excellence and didactic skill.  It should take into consideration the need for coverage of different areas of free radical research, wide geographical distribution, and suitable representation of female and younger scientists. \n\nSFRRI-sponsored plenary lecturers are chosen in consultation with the Executive Committee of SFRRI and an international scientific committee, coordinated by the hosting regional society. \n\nCongress organizers should consult SFRRI concerning the publication of plenary lectures.\n\n#### Educational Activities\n\nSince a large number of free radical researchers, particularly from less developed areas come from teaching institutions, educational activity should be included as a program theme.  The Organizing Committee should consult with the Secretary General on the program of educational activities.\n\n#### Satellite Meetings\n\nSatellite meetings enrich the Congress experience and offer further opportunities for in-depth scientific discussions, with savings in time and money.  They should be organized with the approval of and most advantageously in association with the Congress organizers to avoid possibilities of overlap or competition with the Congress. \n\n#### SFRRI Activities\n\nCongress organisers are to ensure that:\n\n* The President or General Secretary of SFRRI is given an opportunity at the Opening Session to present a brief report on SFRRI activities\n* Space is provided in the printed Congress Program for SFRRI to present information about its structure and activities\n* Space is provided at the Congress for graphic representation of SFRRI activities and for exhibition of SFRRI publications.  Space is provided free of charge for the General Assembly Meeting\n* Free time is provided for the General Assembly Meeting, so that it does not overlap the scientific program\n* The SFRRI logo will be displayed prominently on all announcements and publications\n\n#### Advancement and Support of Young Scientists\n\n* Younger free radical scientists are to be given opportunities to present their work in poster sessions and, as much as possible, to meet prominent scientists\n* Registration fees are to be reduced for scientists younger than 30 years\n* Registration fees are to be reduced for older bona fide students who present satisfactory documentation of this status\n* Congress organizers should ensure availability of cheap accommodation (for example in students’ dormitories)\n* Recipients of SFRRI Travel Fellowships are to receive a contribution towards travel, free registration and a contribution towards accommodation during the Congress\n* The selection of SFRRI Travel Fellowships is the responsibility of a Committee chaired by a member of the Executive Committee and further consisting of a representative of the Organizing Committee and of SFRRI Member Societies\n\n#### Financial Matters\n\n* SFRRI and regional SFRR societies have in the past agreed financially to support hosting regional societies in running the Biennial Congresses\n* Any financial profit realised by a Congress shall be shared between the organisers of the Congress and SFRRI in consultation with the SFRRI Treasurer\n* Congress organizers are to provide free office space and meeting facilities for the SFRRI Secretariat and the Executive Committee of SFRRI during the period of the Congress\n* Registration fees are to be waived for Trevor Slater Award Plenary Lecturer\n* The SFRRI Treasurer is responsible for discussion and negotiation of all financial matters in liaison with the Congress Organisers\n\n#### Applications to host an SFRRI Congress\n\nApplications from Adhering Bodies to host an SFRRI Congress will be reviewed by the Executive Committee of SFRRI according to the following criteria (not necessarily in this order):\n\n* time since the last Congress was held in that country\n* contributions of that country to international free radical biology\n* evidence of availability of appropriate infrastructure and facilities\n* estimated attendance\n* least cost and greatest ease of travel for the majority of participants\n* recent Congresses in that same geographical area\n* probability of political stability in the country\n* probability of financial success\n* attractiveness of the venue\n\nThe Executive Committee of SFRRI will normally consider all applications at one of its meetings 2-3 years before the Congress year and select a short list."
}
