{
    "body": "## SFRRI Governance & Byelaws\n\nThe Society for Free Radical Research founded in the United Kingdom in 1982 is an International Society with the following rules (as amended by resolution of the members dated September 11, 1998).\n\n#### 1. Name\n\nThe name of the institution (hereafter called the \"International Society\") is The Society for Free Radical Research International.\n\n#### 2. Status\n\nThe International Society shall be charitable voluntary, non-profit making body of persons associated for the purposes hereinafter appearing.\n\n#### 3. Objects and Power\n\n3.1 The object of the International Society is to advance education in free radical processes with particular reference to those of industrial and medical importance, such education being for the benefit of the public.\n\n3.2 In furtherance of the above object the International Society shall have the following powers:\n\n(a) to provide a forum for discussions;\n\n(b) to receive and apply donations, subscriptions and funds from persons or organizations;\n\n(c) to invest and deal with the International Society's money not immediately required for its objects in or upon any investments, securities or property;\n\n(d) to do all other lawful things necessary to advance the object;\n\n(e) to promote research and publication of its beneficial results.\n\n#### 4. Membership of the International Society\n\nThe international Society shall be constituted of Member Societies with the following objectives and responsibilities:\n\n(a) each Member Society shall have its own constitution, consistent with the objectives of the International Society;\n\n(b) each Member society shall be completely responsible for the election of its own officers and committee, for ensuring its own financial viability and liability and shall determine its own rules governing subscriptions. The subscription will contain a local organization component and an international component;\n\n(c) each Member Society shall be responsible for registering members and collecting subscriptions.\n\n#### 5. The International Committee\n\n(a) The officers of the International Committee will be a President, President-Elect, Secretary and Treasurer;\n\n(b) The International Committee shall consist of two members representing each Member Society, four members (the President, President-Elect, Secretary, and Treasurer) nominated and directly elected by the total international membership, and the trustee, appointed by the President. No less than one member of the International Committee shall be resident at all times in England or Wales. The immediate past-President will be an ex officio member of the International Committee;\n\n(c) Rules for the composition of the International Committee may be amended only at a Biennial General Meeting of the International Society.\n\n(d) The International Committee will decide the venue and timing of the International Committee Meetings,\n\n(e) The International Committee will assist in the coordination of International Meetings on free radicals. The timing and venue of the Biennial International Meetings will be the responsibility of the International Committee.\n\n(f) A written resolution signed by all the members of the International Committee as valid as a resolution passed at a meeting (and for this purpose the resolution may be contained in more than one document and will be treated as passed on the date of the last signature).\n\n(g) The International Committee will assist, to the extent possible, in interregional communications and distribute the International Members' Directory and an International Newsletter as required.\n\n#### 6. Membership of a Member Society\n\nMembership of a Member Society shall be open to any person, irrespective of place of residence, subject to the approval of the Regional Committee. Membership of a Member Society implies membership of the International Society. The international Committee may elect persons of distinction in the fields of Honorary Members of the Society. Honorary members will have all the privileges of membership and not pay a subscription.\n\n#### 7. Constituent Member Societies\n\n(a) The International Committee will consider applications from established societies subject to the subsequent approval of the membership at the Biennial General Meeting.\n\n(b) Any Member Society may withdraw from the International Society at any time with ninety days' notice to the Secretary of the International Committee in writing and with forfeiture of all funds paid.\n\n#### 8. Subscriptions\n\nThe annual subscriptions for members shall be paid to the Regional Treasurer of the Member Society at a sum set by the General Meeting on the recommendation of the Committee. An amount of the annual membership to for each Member Society, determined by the International Committee, shall be payable to the Treasurer of the International Society. The annual subscription to the International Society shall be payable in advance.\n\n#### 9. Procedure of Biennial General Business Meeting\n\n(a) Biennial General Meeting of the International Society shall be held at the biennial scientific meeting of the International Society. Twenty-eight days' notice, giving details of time, place, agenda, and resolutions to change this Constitution shall be given to the members.\n\n(b) A quorum for the General Business Meeting shall not be less than four members of the International Committee (one of whom should be an officer) with at least twenty-five ordinary members.\n\n#### 10. Procedure of Biennial General Business Meeting\n\n(a) The President of the International Committee shall chair any General Business Meeting, If the President is unable to attend, the President-Elect/Secretary/Treasurer shall chair any business meeting. If none of the officers is present within fifteen minutes after the time appointed for holding the meeting, then the numbers present, if sufficient to form a quorum shall choose a member of the Committee, or, if all members of the Committee present decline to preside, then they may choose any member present to preside;\n\n(b) The President of the meeting may, with the consent of the meeting at which a quorum is present, or if such a meeting so decides, adjourn the meeting from time to time or from place to place, but no business shall be transacted at such adjourned meetings other than business for which the adjournment took place.\n\n(c) At all General Business Meetings any resolution put to the vote at the meeting shall, unless this Constitution otherwise provides, be decided by a show of hands by a majority of the members present in person and entitled to vote, or a ballot if the vote is close, and a declaration by the President of the meeting that a resolution has been carried or lost shall be conclusive and the Secretary shall make an entry to that effect in the minute book. If the vote is contested by any member, a written ballot will be held at the meeting.\n\n#### 11. Election of the International Committee\n\n(a) The election of the President-Elect, Secretary and Treasurer to the International Committee shall take place by a secret ballot at each Biennial General Meeting and shall be open to all members of the International Society. Members may either vote by post or personally at the Meeting. The postal votes received by the Secretary to the International Committee or his representatives shall be added to those cast by other members at the meeting.\n\n(b) In giving notice of the Biennial General Meeting, the Secretary shall submit a list of the International Committee distinguishing those eligible for re-election, and shall request nominations for the new Committee.\n\n(c) In addition to the nominations from the nomination committee, any member may be entitled to nominate any other member for each office provided the nominee has consented to stand and is eligible for the office. Nominations shall be seconded by five other members and shall be received in writing not less than twenty-eight days before. The date of Biennial General Meeting, if there has not been at least one nomination for each office the Secretary via in consultation with international Committee Members make such provision as ensures that there shall be at least one nominee for each office.\n\n(d) (i) The President and President elect shall serve for a period of two calendar years.\n\n(ii) The President-Elect shall serve as President in the two-year period following his/her election as President-Elect.\n\n(iii) The Secretary and the Treasurer shall serve for four calendar years and shall be eligible for re-election to a second four-year term\n\n(iv) After his/her period of office, any officer of the International Committee shall be eligible to serve in another office, during the next four-year period, provided that they do not serve on the International Committee for more than four consecutive terms.\n\n(v) The election of all officers shall be completed at biennial meetings. Terms of office for all officers shall commence on the first day of January following the biennial meeting at which they were elected.\n\n#### 12. Procedure at International Committee Meetings\n\n(a) The International Committee may meet together and undertake business and adjourn, as they think fit. Questions arising at any meeting shall be decided by a simple majority of votes. In the case of an equality of votes the President will have the casting vote.\n\n(b) A quorum of the International Committee shall be two officers with at least 50% of the delegates from constituent Member Societies. In the absence of the officers the Committee shall elect one of their number as acting Chairman.\n\n(c) On the request of any six members of the International Committee the Secretary shall at any time summon a meeting of the International Committee with three months.\n\n(d) The International Committee shall cause proper minutes to be made of the Proceedings of all meetings of the International Society and of the International Committee and of all business transacted at such meetings and all such minutes shall be signed by the President of such meetings which shall be sufficient evidence without any further proof of the facts therein stated.\n\n(e) All acts done by any meetings of the members of the International Committee or by any person acting as a. member of the International Committee are in good faith. Should it be afterwards discovered that there is some defect in the appointment of any such member of the International Committee or person acting as aforesaid, or that they or any of them were disqualified, their actions would be deemed as valid as if every such person had been duly appointed and was qualified to be a member of the International Committee.\n\n#### 13. Accounts\n\n(a) The International Committee shall cause proper books of accounts to be kept with respect to, (I) all sums of money received and expended by the International Society, (ii) all sales and purchases by the International Society and (iii) all assets and liabilities of the International Society,\n\n(b) At each Biennial General Meeting the International Committee shall, present to the members of the International Society an account of income and expenditure since the last Biennial General Meeting made up to the preceding March 31st together with a balance sheet made up as at the same date.\n\n(c) The International Committee shall have the accounts audited by an independent auditor.\n\n(d) Banking account(s) shall be held in the name of the International Society and all checks shall be signed by the Treasurer, the President or the Secretary.\n\n#### 14. Amendment to Constitution\n\n(a) The International Committee may make recommendations to alter, amend or add to this Constitution by resolution passed at any meeting by a majority of not less than two-thirds of the members present and voting subject to the approval of the next Biennial General Meeting except that no such alteration, amendment or addition may be made to the objects of the International Society without the consent of the Charity Commission of England and Wales and no such alteration, amendment or consent shall be valid it would result in the International Society ceasing to be an English charity.\n\n(b) Members unable to attend the Biennial General Meetings at which such resolution is voted on may vote on such resolution by post and all postal votes received by the International Committee not later than minutes before the time of the meeting shall be added to those cast personally at the meeting, In any case, two thirds of the votes cast by mail by lot must affirm the amendment,\n\n#### 15. Application of Income and Property\n\nThe income and property of the International Society shall be applied solely towards the promotion of its objects. No part shall be paid or transferred directly or indirectly to its members or to us International Committee members except in the case of members pursuant to such objects or except in the case of member of International Committee members for payment in good faith.\n\n(a) of reasonable and proper out of pocket expenses (including hotel and travel cost(s)) incurred in the performance of relevant duties. This would not normally include attending a conference or International Committee meeting only.\n\n(b) of interest at a reasonable rate on money lent to the International Society,\n\n(c) of reasonable and proper rent for premises to the International Society,\n\n(d) to any company in which any International Committee member has no more than 1% holding.\n\n#### 16. Winding Up\n\nThe International Society may only be dissolved by resolution at a General Meeting approved by seventy-five per cent of the members present and voting; postal votes shall be allowed. In the event of winding up the assets of the International Society after payment of debts and liabilities shall be distributed in accordance with the objects of the International Society to such charitable purposes as the International Committee shall decide.\n\nMay 7, 2004"
  }
  