{
  "body": "## President’s Message January 2025\n\n\nI am honoured to write as SFRRI President, and on behalf of the SFRRI Executive, to wish you all a successful 2025.\n\nIt is a rather daunting task to fill the shoes of my predecessor Prof. Giovanni Mann. I would like to thank him for his generous and outstanding service over many years, first as Secretary-General, then President-Elect and President. Fortunately for all of us, with Giovanni taking up the position of Immediate Past-President, the SFRRI Executive will be able to continue relying on his second-to-none knowledge of our Society and its day-to-day running.\n\nOn behalf of the SFRRI Executive and all regional SRFF Societies, I join Giovanni in thanking both the outgoing Treasurer, Prof. Lin Mantell, and President-Elect, Prof. José Viña. I am confident Lin will continue to serve the Society, particularly given her leading role in ‘Women in Science’.\n\nI am also delighted to welcome Prof. Hozumi Motahashi as the new SFRRI President-Elect and Prof. Corinne Spickett as the new SFRRI Treasurer. Together with Giovanni, Lin, and Prof. Patricia Oteiza (Secretary-General), I have already had the pleasure of working with both Hozumi and Corinne, and I am very much looking forward to engaging with the entire SFRRI Executive over the next two years. \n\n2025 is an exciting year for our Society, with SFFR-Europe hosting the 22nd SFRRI Biennial Meeting in Galway, Ireland from 3-6 June 2025. The outline of the Scientific Program of this meeting is now available (https://www.sfrrgalway2025.com) and I warmly encourage all our members to attend. There will be many highlights as well as opportunities for young(er) and more seasoned members to contribute to the meeting. These include: 12 symposia, 9 Keynote/Award lectures, 6 selected Oral Presentations, 2 Poster Presentations, as well as several specialised Sessions, including ‘Women in Science’, ‘ECR Networking’, ‘Young Investigator Award Presentations’ and ‘Flash Talks’. \n\nThe deadline for abstracts for those wishing to be considered for oral presentations is 10 February 2025, while 20 March 2025 is the deadline for other abstracts including those from invited symposia speakers as well as SFRRI and SFRRE Awardees. There are also several Travel Awards available that ECR members of a regional SFRR Society can apply for. Information about these Travel Grants can be found on the website of the 2025 SFRRI Biennial Meeting, as well as the websites of the regional SFRR Societies.\n\nI look forward to serving as SFRRI President for the next two years. I will try my best to actively support and further strengthen SFRRI, and especially its interactions with regional SFRR Societies and the wider redox communities. I invite regional SFRR Societies and all their members to contact me with relevant information about activities their respective Societies are organising so that these can be uploaded on the SFRRI website. I also welcome ideas on how we can jointly strengthen and grow our Society. \n\nWith my best wishes for 2025 and beyond, \n\nRoland Stocker\n\nPresident SFRR-International",
  "upload_path": "/admin/files/uploads/roland-stocker.jpg",
  "name": "Professor Roland Stocker"
}
