{
  "body": "## President’s Message 2024\n\nOn behalf of the SFRRI Executive, Roland Stocker, Patricia Oteiza, Lin Mantell and Jose Vina, I am writing to wish you the very best for 2024 and thank all regional SFRR Societies for their continued support of SFRRI.\n\nI am delighted with the success of the 21st Biennial SFRRI meeting hosted by SfRBM in Punta del Este, Uruguay from 15-18 November 2023. The joint conference was co-chaired by Prof. Raphael Radi and Prof. Francisco Laurindo and attended by delegates from South and North America, Europe, Asia and Australasia. The programme featured keynote lectures by the SFRRI Trevor Slater Awardee (Prof. Maret Traber), SFRRI Lester Packer Awardee (Prof. Jose Vina) and SFRRI Alberto Boveris Awardee (Prof. Helmut Sies), as well as SfRBM award lectures by Prof. Bruce Freeman and Prof. Stuart Lipton. In addition to a pre-conference session ‘New Horizons in Redox Biology – Redox Metabolism’, sunrise schools and excellent interactive poster sessions, the conference featured 18 symposia. The programme and a photo gallery can be downloaded from <http://www.sfrr.org/past-conferences>\n\nThe 22nd SFRRI Biennial Meeting will be hosted by SFRR-Europe in Galway, Ireland from 3-6 June 2025. Ireland is a country renowned for its natural beauty and Galway is known as Ireland’s cultural heart. The meeting will be held in the University of Galway, which is conveniently located a 5-min walk of Galway city center and 10-min walk of campus accommodation. In addition to university accommodation, there are international hotels and many fine guesthouses and apartment rentals within easy walking distance of the conference venue. Galway is served by an extensive public transport network linking Dublin, Shannon and Knock airports.\n\nPlease email me directly if you would like recent highlights or further information from your regional SFRR Society uploaded on the SFRRI web pages.\n\nWe look forward to welcoming you at the 22nd SFRRI Biennial Meeting in Galway, Ireland in June 2025!\n\nWith best wishes for 2024,\n\nGiovanni E. Mann\n\nPresident SFRR-International",
  "upload_path": [
    "/admin/files/uploads/giovanni-e-mann.jpg"
  ],
  "name": "Professor Giovanni Mann"
}
