{
  "body": "## President’s Message December 2024\n\nI am writing on behalf of the SFRRI Executive to wish you the very best for the seasons holiday.\n\nI am delighted to welcome Prof. Roland Stocker as the new SFRRI President, Prof. Hozumi \nMotahashi as the new SFRRI President-Elect and Prof. Corinne Spickett as the new SFRRI Treasurer.  Roland, Hozumi and Corinne will be taking up their positions on 1 January 2025, and Patricia Oteiza will continue to serve as General Secretary. I will serve on the SFRRI Executive as Past-President for the next two years.   \n\nOn behalf of Patricia Oteiza, Roland Stocker and Jose Vina and all regional SFRR Societies, I would like express our appreciation to Prof. Lin Mantell, who as SFRRI Treasurer underpinned the management of our Society’s finances and outreach support. Lin Mantell was instrumental in liaising effectively with regional SFRR Societies and in particular in leading the SFRRI ‘Women in Science’ initiative launched at the 19th SFRRI Biennial Meeting in Lisboa, Portugal in 2018.  We thank Lin for her continued commitment to SFRRI and involvement in strengthening the links between regional SFRR Societies and our redox community. \n\nSFFR-Europe is hosting the 22nd SFRRI Biennial Meeting in Galway, Ireland from 3-6 June 2025 \n([https://www.sfrrgalway2025.com](https://www.sfrrgalway2025.com/)) and, as Chair of this meeting, Kasia Whysall is liaising closely with the Executives of SFRR-Europe and SFRRI.  An international scientific committee selected 12 symposia from a total 25 submitted proposals and 9 keynote lectures:   \n\n* SFRRI Trevor Slater Awards ([Prof. Michael Davies](https://researchprofiles.ku.dk/en/persons/michael-j-davies) and [Prof Giovanni Mann](https://www.kcl.ac.uk/people/giovanni-e-mann)) \n* SFRRI Lester Packer Award ([Prof. Giuseppe Poli](https://medchirurgiasl.campusnet.unito.it/do/docenti.pl/Alias?giuseppe.poli#tab-profilo)) \n* SFRRI Alberto Boveris Award ([Prof. Enrique Cadenas](https://profiles.sc-ctsi.org/enrique.cadenas)) \n* SFRRI Kelvin & Joanna Davies Rising Star Award ([Dr. Carlos Henriquez Olguín](https://researchprofiles.ku.dk/en/persons/carlos-henriquez-olgu%C3%ADn)) \n* SFRR-E Annual Award (Prof. Daniela Caporossi) \n* SFRR-E Basic Science Award (Prof. Juan Sastre)\n* SFRR-E Leopold Flohe Redox Pioneer Award (Dr. Aphrodite Vasilaki) \n* SFRR-E Catherine Pasquier Award (Dr. Paraskevi Kritsiligkou) \n\nIreland is a country renowned for its natural beauty and Galway is known as Ireland’s cultural heart. The meeting will be held in the University of Galway, which is conveniently located a 5-min walk of Galway city centre and 10-min walk to campus accommodation. In addition to university accommodation, there are international hotels and many fine guesthouses and apartment rentals within easy walking distance of the conference venue. Galway is served by an extensive public transport network linking Dublin, Shannon and Knock airports. \n\nWe look forward to welcoming you at the 22nd SFRRI Biennial Meeting in Galway, Ireland in June 2025!  Early career researchers who are members of a regional SFRR Society are eligible to apply for SFRRI and Oxygen Club of California Travel Awards to partially support travel/subsistence to present their research as oral or poster communications. \n\nI welcome regional SFRR Societies emailing me further information from their Society, which can be uploaded on the SFRRI website. \n\nIt has been an honour to serve as SFRRI President for the past years, and I will continue to actively support and strengthen SFRRI interactions with regional SFRR Societies and the wider redox community. \n\nWith my best wishes for the seasons holidays, \n\nGiovanni E. Mann\n\nPresident SFRR-International",
  "upload_path": "/admin/files/uploads/giovanni-e-mann.jpg",
  "name": "Professor Giovanni Mann"
}
