{
  "body": "## President’s Message 2024\n\nOn behalf of the SFRRI Executive, Roland Stocker (President-Elect), Patricia Oteiza (Secretary General), Lin Mantell (Treasurer) and Jose Vina (Past President), I am writing to provide members of regional SFRR Societies with an update on the 22nd SFRRI Biennial Meeting to be held in Galway, Ireland 3-6 June 2025. \n\nPlanning for the 22nd SFRRI Biennial Meeting together with our hosts SFRR-Europe is progressing  well (see <https://www.sfrrgalway2025.com>). The meeting will be held in the University of Galway, which is conveniently located 5-min walk from Galway city center and 10-min walk from excellently equipped and affordable campus accommodation. In addition to university accommodation, there are international hotels and many fine guesthouses and apartment rentals within easy walking distance of the conference venue.  Galway is served by an extensive public transport network linking Dublin, Shannon and Knock airports.[](https://sfrr.org/past-sfrri-conferences)\n\nWe have asked regional SFRR Societies to disseminate our ‘Call for Symposia Proposals’ (<https://www.sfrr-europe.org/index.php/meetings/sfrr-international-biennial-meeting-2025>) and ‘Call for Nomination of SFRRI Award Lectures 2025 (see <https://sfrr.org>) to their membership. We encourage regional SFRR Societies to submit symposia proposals and to nominate candidate(s) for the SFRRI Trevor Slater, Lester Packer, Alberto Boveris and Kelvin & Joanna Davies Rising Star Award Lectures by the deadline of 20 September 2024.  In addition to state-of-the research symposia, SFRRI and SFRR-Europe award lectures and a designated ‘Women in Science’ session, this international meeting will enable vibrant and interactive oral and poster communications. We particularly encourage Early Career Researchers to submit abstracts for this meeting and benefit from discussing their research with colleagues and senior, established researchers.\n\nIn the meantime, please email me directly if you would like us to upload recent highlights from your regional SFRR Society on the SFRRI web pages.\n\nWe look forward to welcoming you at the 22nd SFRRI Biennial Meeting in Galway, Ireland in June 2025!\n\nWith best wishes for the summer,\n\nGiovanni E. Mann\n\nPresident SFRR-International",
  "upload_path": "/admin/files/uploads/giovanni-e-mann.jpg",
  "name": "Professor Giovanni Mann"
}
