{
  "sfrri_executive_members": [
    {
      "title": "President",
      "name": "Roland Stocker",
      "upload_path": "/admin/files/uploads/roland-stocker.jpg",
      "bio": "Roland Stocker trained as a biochemist at the Federal Institute of Technology in Zürich Switzerland (Dipl. Natw. ETH, 1981), the Australian National University in Canberra Australia (PhD, 1985), and the University of California, Berkeley USA (post-doc, 1986-1987).\n\nRoland has been an independent investigator from 1987-2022 and a Research Fellow of the National Health & Medical Research Council of Australia from 1994-2020. He has received the Lifetime Achievement Award from the Society for Free Radical Research Australasia and has been recognised as a “Redox Pioneer” by the journal, *Antioxidants & Redox Signalling*. In 2016, Roland was elected as a member of both the Swiss Academy of Medical Sciences and the Australian Academy of Health and Medical Sciences.\n\nRoland's laboratory has investigated redox processes in atherosclerosis and related vascular diseases and made pioneering contributions to the discovery of the beneficial activities of bilirubin; the elucidation of the molecular action of vitamin E in lipoproteins; the identification of arterial myeloperoxidase activity as a cause of atherosclerotic plaque destabilization and target for non-invasive imaging of high-risk atherosclerotic plaques; and the discovery of a novel redox pathway that regulates vascular tone and blood pressure in inflammation.\n\nRoland has served or currently serves as a member of the Editorial Board of all journals dedicated to free radical research, and he has also been President of the Society for Free Radical Research Australasia. He has published a career total of 353 articles. His work has been cited >51,000 and his current h-index is 114.\n\nRoland closed his laboratory in December 2022, and currently is a Distinguished Fellow at the Heart Research Institute, Sydney. He remains active and engaged, contributing to ongoing research projects, and providing support and advocacy, particularly to early career scientists.",
      "address": "**Professor Roland Stocker**\n\nThe Heart Research Institute\n\n7 Eliza Street\n\nNewtown NSW 2042\n\nAustralia",
      "contact_details": "Tel: +61(410) 782 588\n\nEmail: [roland.stocker@hri.org.au](mailto:roland.stocker@hri.org.au)"
    },
    {
      "title": "President-Elect",
      "name": "Hozumi Motohashi",
      "upload_path": "/admin/files/uploads/motohashi250116reduced.png",
      "bio": "Hozumi Motohashi earned her M.D. from Tohoku University School of Medicine in 1990. After completing a two-year clinical residency in otolaryngology, she pursued doctoral studies at the Tohoku University Graduate School of Medicine, receiving her Ph.D. in 1996. Her thesis explored the regulatory mechanisms and in vivo functions of MafK, a small Maf transcription factor, which acts as a critical heterodimeric partner for the CNC family of transcription factors, including NRF2.\n\nFollowing her Ph.D., Hozumi joined the University of Tsukuba as a research assistant professor, where she focused on the functions and biological significance of CNC-sMaf transcription factors. In 2006, she returned to Tohoku University as an associate professor, conducting pioneering work on the cellular response mechanisms to oxidative and xenobiotic stress and the role of NRF2 in maintaining homeostasis. Her research also uncovered unique metabolic characteristics of malignant cancers with aberrant NRF2 activation.\n\nIn 2013, Hozumi established her laboratory as a professor at the Institute of Development, Aging, and Cancer at Tohoku University. Her lab initiated new research into NRF2's anti-aging functions and the roles of sulfur metabolism regulated by NRF2. Among sulfur-containing metabolites, supersulfides, characterized by sulfur catenation, emerged as a central focus of her investigations due to their significant roles in NRF2-dependent cytoprotection and other biological processes.\n\nIn 2023, Hozumi was appointed to her current position at the Tohoku University Graduate School of Medicine, where her laboratory relocated. Her research now emphasizes redox metabolism and its influence on gene expression. One of her lab's notable discoveries involves oxygen-mediated regulation of supersulfide synthesis through vitamin B6 bioactivation, a process potentially linked to various pathological conditions caused by chronic hypoxia.\n\nHozumi's overarching research goal is to elucidate how living organisms adapt to environmental challenges and sustain life by investigating NRF2-dependent transcription regulation. Her work focuses on the role of NRF2 and sulfur metabolism in aging-related diseases, including cancer, inflammation, and neurodegeneration.",
      "address": "**Professor Hozumi Motohashi**\n\nDepartment of Medical Biochemistry\n\nGraduate School of Medicine\n\n2-1 Seiryo-machi, \n\nAoba-ku, \n\nSendai 980-8575 \n\nJapan",
      "contact_details": "[](mailto:roland.stocker@hri.org.au)[](https://www.hri.org.au/our-research/arterial-inflammation-and-redox-biology/professor-roland-stocker)Tel: +81 22 717 8089\n\nEmail: [hozumi.motohashi.a7@tohoku.ac.jp](mailto:hozumi.motohashi.a7@tohoku.ac.jp)\n\nURL: <https://sites.google.com/view/motohashi-lab/home>"
    },
    {
      "title": "Secretary-General",
      "name": "Patricia Oteiza",
      "upload_path": "/admin/files/uploads/patricia-oteiza.jpg",
      "bio": "Education\n\n* M.S., Clinical Chemistry, School of Pharmacy and Biochemistry, University of Buenos Aires, Argentina\n* M.S., Biochemistry, School of Pharmacy and Biochemistry, University of Buenos Aires, Argentina\n* Ph.D., Biochemistry, School of Pharmacy and Biochemistry, University of Buenos Aires, Argentina\n\nResearch Interests\n\nPatricia Oteiza has been an active member of SFFRI and SFRBM since 1992, and a member of the Editorial Board of Free Radical Biology and Medicine and Redox Biology, Archives of Biochemistry and Biophysics, Biofactors and Food and Function (RSC). She has co-organized international conferences on redox biology as part of the Oxygen Club of California, and on polyphenols (International Conference on Polyphenols and Health). In 2004, Prof Otezia was a member of the organizing committee of the SFFRI biennial meeting in Buenos Aires, Argentina and Vice-President of the Free Radical-South America Group Congress in Buenos Aires in 2013. Dr. Oteiza's research program is focused on the basic mechanisms underlying interactions between nutrition and environmental toxicants in human health, in particular during early development and chronic inflammatory disorders. She studies the mechanisms of nutrients/bioactives and toxicants, mainly those involving redox-sensitive signals and that are relevant for neurodevelopment. She has also conducted extensive work on the capacity of plant bioactives, mainly flavonoids, to mitigate obesity- and inflammation-associated pathologies through redox-regulated mechanisms. She is currently studying how flavonoids can modulate inflammation- and oxidative-mediated impairment of events occurring in the gastrointestinal tract that can impact overall health, including insulin resistance, steatosis and brain inflammation.",
      "address": "**Professor Patricia Oteiza**\n\nDepartment of Nutrition\n\nUniversity of California - Davis\n\n3135 Meyer Hall\n\nOne Shields Avenue\n\nDavis, CA 95616-5270\n\nUSA",
      "contact_details": "Tel: +1 53 0754 6074\n\nEmail: [poteiza@ucdavis.edu](mailto:poteiza@ucdavis.edu)\n\nURL: <https://nutrition.ucdavis.edu/people/patricia-oteiza>"
    },
    {
      "title": "Treasurer",
      "name": "Corinne Spickett",
      "upload_path": "/admin/files/uploads/corinne-spickett.jpg",
      "bio": "Corinne Spickett is currently a Professor at Aston University, following a move from the University of Strathclyde in January 2011. Her first degree was in biochemistry at Oxford University, and she has a D.Phil. (Oxon) on the application of NMR to study yeast bioenergetics *in vivo*. After further postdoctoral work using NMR to investigate stress responses in plants and glutathione metabolism in pre-eclamptic toxaemia, she became a Glaxo-Jack Research Lecturer in the Department of Immunology at the University of Strathclyde. Since then, she has been working on the analysis of phospholipid oxidation by electrospray mass spectrometry and the biological effects of oxidized lipids, especially as relating to atherosclerosis and inflammation, and has published extensively in this field. She has also applied her expertise in analysis of phospholipids to lipidomic studies of LDL in chronic kidney disease and to yeast membrane changes. More recently, she expanded her research to include lipidomics as well as ox-lipidomics, analysis of protein oxidation and formation of lipoxidation products during inflammation, and her group has developed label-free, semi-targeted approaches to their identification in biological samples. \n\nProf Spickett was Treasurer of the Society for Free Radical Research Europe from 2007-16, and then a member of the SFRR-E Council.  She is a member of the Steering Committee of the International HNE-Club. She was a Workgroup Leader in the COST Actions B35 on Lipid Peroxidation Associated Disorders and CM1001 on Chemistry of non-enzymatic protein modification and is now responsible for communication and dissemination in COST Action CA19105 EpiLipidNET. She was the Coordinator of the H-2020 Innovative Training Network “MASTRPLAN” on MASS spectrometry TRaining network for Protein Lipid adduct Analysis, and a group Leader in the Innovative Training Network project MemTRain. At Aston University she was Director of Research for the Biosciences Research Group and is now a member of Aston Institute for Membrane Excellence, funded by Research England.",
      "address": "**Professor Corinne M. Spickett**\n\nDepartment of Biosciences\n\nSchool of Life & Health Sciences\n\nAston University\n\nBirmingham, B4 7ET, UK.",
      "contact_details": "Tel: +44 (0)121 204 4085\n\n[](mailto:mantelll@stjohns.edu)Email: [c.m.spickett@aston.ac.uk](mailto:c.m.spickett@aston.ac.uk)\n\n[](mailto:c.m.spickett@aston.ac.uk)URL: [](<>)<https://research.aston.ac.uk/en/persons/corinne-spickett>"
    },
    {
      "title": "Immediate Past-President",
      "name": "Giovanni E. Mann",
      "upload_path": "/admin/files/uploads/giovanni-e-mann.jpg",
      "bio": "Giovanni Mann obtained his BSc in Zoology (1973) from George Washington University, Washington D.C. USA and MSc (1974) and PhD in Physiology (1978) from University College London. After a 4-year postdoctoral Research Fellowship at Queen Elizabeth College London, he was appointed to a Lectureship in Physiology (1981), Readership in Physiology (1992) and then as Professor of Vascular Physiology at King's College London in 1997.\n\nHe previously served as President-Elect and Secretary General of SFRR-International and as President of the SFRR-Europe, Chairman/Vice Chairman of The Physiological Society, President of the European Pancreatic Society, President of the European Microcirculation Society, President of the British Microcirculation Society and as a Council Member of the Physiological Society, Society for Free Radical Research-Europe, European Society for Microcirculation and Member of International Liaison Committee for Microcirculation.\n\nGiovanni Mann is Reviews and Special Issues Editor for Free Radical Biology & Medicine and the Chair of the Ethics Committee for Free Radical Biology & Medicine. He is an Associate Editor for Physiological Reviews and on the Editorial Board of Redox Biology. He has served on Editorial Boards of The Journal of Physiology, Microcirculation and an Editorial Advisor for the Biochemical Journal. He serves on the Board of External Referees for the Biotechnology & Biological Sciences Research Council and College of Experts for the Medical Research Council - Physiological Systems & Clinical Sciences and was previously Chair of Heart Research UK Translational Sciences panel and served on The Royal Society International Networks Panel. He has published >180 research papers (h-index 59) and coordinated >45 research symposia at international conferences, including a Plenary Symposia focused on 'Oxygen Matters in Redox Biology' at the joint meeting of the Society for Redox Biology (SFRBM) and Society for Free Radical Research International (SFRRI) in San Francisco 2016 and at the SFRRI Meeting in Lisbon, Portugal 2018.\n\nHis Vascular Biology research group at King's College London is investigating signalling cascades involved the transcriptional activation of antioxidant defence genes in endothelial and smooth muscle cells in oxidative stress. We are interested in vascular dysfunction induced by oxidative stress in diseases such as gestational diabetes and stroke, and the health benefits of dietary inducers of the redox sensitive transcription factor Nrf2 involved the upregulation of endogenous antioxidant defences. More recently, his group have focused on the importance of adapting human cultured vascular and other cell types long-term to 'physiological' oxygen levels to investigate Nrf2 and nitric oxide signalling in response to inflammatory mediators and/or laminar shear stress.",
      "address": "**Giovanni E. Mann, Professor of Vascular Physiology**\n\nKing's British Heart Foundation Centre of Research Excellence\n\nSchool of Cardiovascular and Metabolic Medicine & Sciences\n\nFaculty of Life Sciences and Medicine\n\nKing's College London\n\nFranklin-Wilkins Building (Rm 3.01)\n\n150 Stamford Street\n\nLondon SE1 9NH\n\nUK",
      "contact_details": "Tel: +44 (0)20 7848 4306\n\nEmail: [giovanni.mann@kcl.ac.uk](giovanni.mann@kcl.ac.uk)\n\nURL: <https://www.kcl.ac.uk/people/giovanni-e-mann>"
    },
    {
      "title": "Trustee",
      "name": "Frank J Kelly",
      "bio": "[kcl.ac.uk/people/frank-kelly](https://kcl.ac.uk/people/frank-kelly)\n\nProfessor Frank Kelly holds the Inaugural Chair in Community Health and Policy at Imperial College London, where he is Director of the Environmental Research Group, Director of the NIHR Health Protection Research Unit on Environmental Exposures and health and Deputy Director of the MRC-PHE Centre for Environment & Health.\n\nProf Kelly leads a substantial research activity which spans all aspects of air pollution research from toxicology to science policy. He has examined the toxicity of PM associated metals and quinones, diesel and biodiesel exhaust emissions, wood smoke and the identification of biomarkers of exposure. A new area of investigation is ambient microplastics including heir identification and potential health effects.\n\nProf Kelly is past President of the European Society for Free Radical Research and past Chairman of the British Association for Lung Research. He provides policy support to the WHO on air pollution issues and he is past Chairman of COMEAP the UK's Department of Health's Expert Committee on the Medical Effects of Air Pollutants.",
      "address": "**Professor Frank J Kelly, PhD, FRSB, FRSC, FKC, FMedSci**\n\nEnvironmental Research Group\n\nFaculty of Medicine\n\nImperial College London\n\nLondon W12 0BZ\n\nUK",
      "contact_details": "Tel: +44 (0)20 7594 8098 ext 48098\n\nEmail: [frank.kelly@imperial.ac.uk](mailto:frank.kelly@imperial.ac.uk)\n\nURL: <https://www.imperial.ac.uk/people/frank.kelly>",
      "upload_path": "/admin/files/uploads/frank-j-kelly.jpg"
    }
  ]
}
