{
  "body": "SFRRI WIS was established as a SFRRI sub-committee in 2018 with strong support from the SFRRI Executive Committee. At the SFRRI Biennial Meeting (hosted by SFRR-Europe) in Lisbon, Portugal in 2018, SFRRI WIS and SFRR-Europe WIS and Society for Redox Biology and Medicine WIS organized the first international WIS Forum, attended by more than 50 female and male scientists. At the SFRRI WIS Forum in Lisbon, Lin Mantell, Marie-Carmen Gomez Cabrera and Maria Paola Nitti chaired a Round Table discussion with Chang Chen, Ting-Ting Huang, Elizabeth Ledgerwood and Patricia Oteiza. In 2021, WIS from all regional SFRR Societies were invited and agreed to join the SFRRI WIS Forum.\n\nThe Women in Science (WIS) Forum of SFRRI is an evolving and dynamic sub-committee that seeks to support and enhance the careers, scientific achievements and leadership roles of women in the field of redox biology and medicine.\n\n#### Our objectives are to:\n\nExpand the participation, visibility, and leadership roles of female scientists in all Society functions and activities\n\nInvite female scientists to present their research at the Annual Conferences\n\nProvide training workshops on essential career skills\n\nPromote leadership development and opportunities for junior scientists\n\nEncourage the use of collaborative models that maximize openness, inclusiveness, and mutual success.\n\n#### Leadership and Development:\n\nOne of the goals of WIS is to develop strategies to promote women in leadership roles in the scientific community, both within SFRRI as well as in their careers. We are exploring ways for women within SFRRI to network with those who have obtained leadership roles as officers, editors and participating in plenary sessions at SFRRI Biennial Meetings. We also promote and encourage the nomination of highly successful female scientists for distinguished awards given by the SFRRI.\n\n#### Website:\n\nIn addition to leadership development, WIS maintains the Women in Science (WIS) webpage on the SFRRI website. The purpose of the webpage is to increase awareness of the WIS Forum and thereby increase participation of female scientists in the SFRRI WIS Forum. Please contact Prof. Lin Mantell for further information and to share WIS event in your regional SFRR Societies.\n\nChair: Professor Lin Mantell (Email: [mantelll@stjohns.edu](mailto:mantelll@stjohns.edu))\n\n[Download PDF](/admin/files/uploads/women-in-science-forum-sfrri.pdf)",
  "upload_path": [
    "/admin/files/uploads/women-in-science-forum-sfrri.pdf"
  ]
}
